yanforrest/MasteringMCU/stm32f4xx_drivers/Src/014i2c_slave_tx_string2.c
/* 010i2c_master_tx_testing.c */
/* Have not finished , need to be modified in the future*/

#include <stdio.h>
#include <string.h>
#include "stm32f407xx.h"

#define SLAVE_ADDR 0x68
#define MY_ADDR 0x68

uint32_t data_len = 0;

//very large message
uint8_t Tx_buf[] = "HiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHiHi";

uint8_t CommandCode;

void delay(void)
{
	for(uint32_t i = 0; i < 500000/2 ; i++);
}
	
I2C_Handle_t I2C1Handle;

// received buffer
uint8_t rcv_buf[32];


/*
 * PB6 _> SCL
 * PB9 -> SDA
 */
void I2C1_GPIOInits(void)
{
	GPIO_Handle_t I2CPins;
	
	I2CPins.pGPIOx = GPIOB;
	I2CPins.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_ALTFN;
	I2CPins.GPIO_PinConfig.GPIO_PinOPType = GPIO_OP_TYPE_OD;
	I2CPins.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_NO_PUPD;
	I2CPins.GPIO_PinConfig.GPIO_PinAltFunMode = 4;
	I2CPins.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_FAST;
	
	//scl
	I2CPins.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_6;
	GPIO_Init(&I2CPins);
	
	//sda
	I2CPins.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_7;
	GPIO_Init(&I2CPins);	
	
}

void I2C1_Inits(void)
{
	I2C1Handle.pI2Cx = I2C1;
	I2C1Handle.I2C_Config.I2C_AckControl = I2C_ACK_ENABLE;
	I2C1Handle.I2C_Config.I2C_DeviceAddress = MY_ADDR;
	I2C1Handle.I2C_Config.I2C_FMDutyCycle = I2C_FM_DUTY_2;
	I2C1Handle.I2C_Config.I2C_SCLSpeed = I2C_SCL_SPEED_SM;
	
	I2C_Init(&I2C1Handle);
}

void GPIO_ButtonInit(void)
{
	GPIO_Handle_t GPIOBtn, GpioLed;
	
	//this is btn gpio configuration 
	GPIOBtn.pGPIOx = GPIOA;
	GPIOBtn.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_0;
	GPIOBtn.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_IN;
	GPIOBtn.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_FAST;
	GPIOBtn.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_NO_PUPD;
	
	GPIO_Init(&GPIOBtn);
	
	// this is led gpio configuration 
	GpioLed.pGPIOx = GPIOD;
	GpioLed.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_12;
	GpioLed.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_OUT;
	GpioLed.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_FAST;
	GpioLed.GPIO_PinConfig.GPIO_PinOPType= GPIO_OP_TYPE_OD;
	GpioLed.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_NO_PUPD;
	
	GPIO_PeriClockControl(GPIOD, ENABLE);
	GPIO_Init(&GpioLed);
}

int main()
{
	
	GPIO_ButtonInit();
	
	// i2c pin inits
	I2C1_GPIOInits();
	
	//i2c peripheral configuration
	I2C1_Inits();
	
	// 2
	//enable the i2c peripheral 
	I2C_PeripheralControl(I2C1, ENABLE);
	
	// ack bit is made 1 after PE = 1  
	I2C_ManageAcking(I2C1, I2C_ACK_ENABLE);
	
	// 1
	//i2c REQ configuration
	I2C_IRQInterruptConfig(IRQ_NO_I2C1_ER, ENABLE);
	I2C_IRQInterruptConfig(IRQ_NO_I2C1_EV, ENABLE);


	I2C_SlaveEnableDisableCallbackEvents(I2C1, ENABLE);


	while(1);
}

void I2C1_EV_IRQHandler(void)
{
	I2C_EV_IRQHandling(&I2C1Handle);
}

void I2C1_ER_IRQHandler(void)
{
	I2C_ER_IRQHandling(&I2C1Handle);
}


void I2C_ApplicationEventCallback(I2C_Handle_t *pI2CHandle, uint8_t AppEv)
{	
	static uint8_t commandCode = 0;
	static uint8_t Cnt = 0;
	
	if (AppEv == I2C_EV_DATA_REQ) {
		//Master wants some data. slave has to send it
		if (commandCode == 0x51) {
			//send the length information to the master
			I2C_SlaveSendData(pI2CHandle->pI2Cx, strlen((char * )Tx_buf));
		} else if (commandCode == 0x52) {
			//Send the contents of Tx-buf
			I2C_SlaveSendData(pI2CHandle->pI2Cx,Tx_buf[Cnt++]);
		}
			
	} else if (AppEv == I2C_EV_DATA_RCV){
		//Data is waiting for the slave tor ead. slave has to read it
		commandCode = I2C_SlaveReceiveData(pI2CHandle->pI2Cx);
	} else if (AppEv == I2C_ERROR_AF){
	  // This happens only during slave txing.
	  // Master has sent the NACK. so slave should understand that master doesnt need 
	  // more data
	  
	   commandCode = 0xff;
	   Cnt = 0;
	} else if (AppEv == I2C_EV_STOP){
	  // This happens only during slae reception. 
	  // Master has ended the I2C communication with the slave.
	  
	  
	}
}
